// 연산자 : 산술, 할당, 비교 등을 통해 새로운 값을 생성
// 피연산자 : 연산의 대상
console.log(5 - 4); // 5 - 4는 5에서 4를 빼 1이라는 값 생성
console.log(10 > 4); // 10과 4를 비교해 true라는 값 생성

// 산술 연산자 : 피연자에 수학적 계산을 해 새로운 값 생성
console.log(1 + 4); // 1과 4를 더해 5 생성
console.log(2 - 10); // 2에서 10을 빼 -8 생성
console.log(5 * 4); // 5와 4를 곱해 20 생성
console.log(10 / 2); // 10을 2로 나눠 몫 5 생성
console.log(10 % 3); // 10과 3을 나눠 나머지 1 생성

// 단항 산술 연산자 : 1개의 피연산자에 산술 연산
// ++ : 증가
// -- : 감소
var x = 10;
x++; // 11
x++; // 12
x--; // 11
--x;
console.log(10);
